---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostFamilyCanHostRebarParam
source: html/cfe39faf-fb9b-1f42-cf09-b2f9cba7b6f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostFamilyCanHostRebarParam Property

Rebar can't be placed in this Generic Model element because rebar hosting is disabled in the family [Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRebarHostFamilyCanHostRebarParam { get; }
```